#-*-coding:utf-8-*- 
# author lyl
# from sklearn.tree import DecisionTreeClassifier
from lylearn.tree import DecisionTreeClassifier
# from lylearn.naive_bayes import MultinomialNB


labels = ['色泽', '根蒂', '敲声', '纹理', '脐部', '触感']

X = [
    ['青绿', '蜷缩', '浊响', '清晰', '凹陷', '硬滑'],
    ['乌黑', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑'],
    ['乌黑', '蜷缩', '浊响', '清晰', '凹陷', '硬滑'],
    ['青绿', '稍蜷', '浊响', '清晰', '稍凹', '软粘'],
    ['乌黑', '稍蜷', '浊响', '稍糊', '稍凹', '软粘'],
    ['青绿', '硬挺', '清脆', '清晰', '平坦', '软粘'],
    ['浅白', '稍蜷', '沉闷', '稍糊', '凹陷', '硬滑'],
    ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '软粘'],
    ['浅白', '蜷缩', '浊响', '模糊', '平坦', '硬滑'],
    ['青绿', '蜷缩', '沉闷', '稍糊', '稍凹', '硬滑'],
]

y = ['是', '是', '是', '是', '是', '否', '否', '否', '否', '否']

pred_X = [
    ['青绿', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑'],
    ['浅白', '蜷缩', '浊响', '清晰', '凹陷', '硬滑'],
    ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '硬滑'],
    ['乌黑', '稍蜷', '沉闷', '稍糊', '稍凹', '硬滑'],
    ['浅白', '硬挺', '清脆', '稍糊', '平坦', '硬滑'],
    ['浅白', '蜷缩', '浊响', '稍糊', '平坦', '软粘'],
    ['青绿', '稍蜷', '浊响', '稍糊', '凹陷', '硬滑']
]

pred_y = ['是', '是', '是', '否', '否', '否', '否']

X.extend(pred_X)
y.extend(pred_y)

model = DecisionTreeClassifier(attr=labels)

model.fit(X, y)
print(model.predict(pred_X))
print(model.score(pred_X, pred_y))

model.plot_tree()
